package entry;

import org.junit.Test;

/**
 * <类详细说明>
 *
 * @Author： Huanghai
 * @Version: 2016-09-23
 **/
public class ParamSplitTest {
    @Test
    public void testSplitJson() {
        ParamSplit.splitParamsContent("http://gngj.gog.cn/system/2015/02/23/014128176.shtml\n" +
                "北京故宫、南京夫子庙迎来羊年客流高峰\n" +
                "来源：中国新闻网2月22日，农历正月初四，大批游客挤在北京故宫博物院保和殿门前拍照。当天，北京迎来羊年第一个晴天。数万游客涌入故宫博物院，故宫迎来羊年第一个客流高峰日。中新社发张炜摄2月22日，农历正月初四，北京迎来羊年第一个晴天。数万游客涌入故宫博物院，故宫迎来羊年第一个客流高峰日。中新社发张炜摄2月22日，农历正月初四，大批游客挤在北京故宫博物院乾清宫门前拍照。当天，北京迎来羊年第一个晴天。数万游客涌入故宫博物院，故宫迎来羊年第一个客流高峰。中新社发张炜摄2月22日，农历正月初四，大批游客挤在北京故宫博物院保和殿门前拍照。当天，北京迎来羊年第一个晴天。数万游客涌入故宫博物院，故宫迎来羊年第一个客流高峰日。中新社发张炜摄2月22日，农历正月初四，北京迎来羊年第一个晴天。数万游客涌入故宫博物院，故宫因此迎来羊年第一个客流高峰日。中新社发张炜摄[2][3][4]下一页作者：必备行程之一，回归自然，追溯历史，陶冶情操，有特点的旅游景区是不错的选择，该项目的开发符合现代人的需要及经济发展的需求，前景看好。4、项目选址及规模：项目选址于普安县青山镇；占地面积：20亩；建筑面积：6666.7平方米。项目建设内容：规划总面积40平方公里；基础配套设施；铜鼓山夜郎军事旅游区选址保护；文化产业发展；旅游配套服务体系。财务指标分析总投资额5亿元，引资金额5亿元，年销售收入0.9亿元，年利润0.73亿元，投资利润率14.6%，分年度投资计划2年，投资回收期8年。优惠政策及扶持条件。一事一议。项目业主单位联系方式。名称：普安县文体广局；地址：普安县盘水镇营盘社区；邮编：561500；联系人：谭代宽；手机：13985954566；传真:0859-7232950。项目服务单位。普安县投资促进局；地址：贵州省普安县县委大院组织部四楼；邮编：561500；联系人：邓德伟；座机：0859-7236479；手机：15519980078；传真:0859-7236479；邮箱：2373323628@qq.com；QQ：2373323628。作者：");
    }
}
